[
  {
    "id": 1,
    "name": "Robert Johnston",
    "date": "Feb 23, 2023",
    "title": "Head of Marine and Energy at DNV GL",
    "image": "/headshots/Robert Johnston.jpeg",
    "testimonial": "Met Cameron and the team in January. Everyone has been fully behind me since day one and really helped me to achieve my original goals of losing weight and getting fitter. The service does not end there though as they have also provided me lots of invaluable knowledge and habits that will keep in good health long into the future. I can not recommend them highly enough. Totally professional and so knowledgeable. If you commit to their programme, then you can’t fail to be rewarded personally."
  },
  {
    "id": 2,
    "name": "Nicholas McAllister",
    "date": "Feb 21, 2023",
    "image": "/headshots/Nicholas McAllister.jpeg",
    "testimonial": "Cameron and his team have a strong knowledge in both fitness and nutrition. I recently completed the 6 week fitness challenge, and have lost just over 8kg. IT WORKS. The accountability is key. The flexibility of remote PT sessions helps you work around your diary on an adhoc basis, which really helps as we have a young kid at home and work hours can change day to day. If you go ahead with the 6 week programme and buy into the nutrition and fitness you will get results, 100%."
  },
  {
    "id": 3,
    "name": "Ian Worthington",
    "date": "Feb 16, 2023",
    "title": "GymWolfPT",
    "image": "/headshots/Ian WorthingtonIan.jpeg",
    "testimonial": "Cameron is a truly inspirational guy who I admire and respect, not just in the ‘fitness world’ - but in every aspect of life. What he and his team at TRUTH are doing is really brilliant and groundbreaking. I highly recommend Cameron, and all that he does."
  },
  {
    "id": 4,
    "name": "Ryan Burville",
    "date": "October 3, 2022",
    "image": "/headshots/Ryan Burville.jpeg",
    "testimonial": "Highly Recommend Truth Fitness and Cameron. Best programme I have ever signed up for and have achieved instant results. If you are considering using Truth fitness, I would not hesitate in recommending them. Worth every penny."
  },
  {
    "id": 5,
    "name": "Hayley Spedding",
    "date": "July 21, 2022",
    "image": "/headshots/Hayley Spedding.jpeg",
    "linkedIn": "https://www.linkedin.com/in/hayley-spedding-433092103",
    "testimonial": "17 weeks post full knee replacement I wasn’t sure how to make better progress beyond physio appointments and my own attempts at a gym programme. I had a partial knee replacement on the other knee 6 years ago and years of trying to keep weight down, improve muscle strength, give time to my busy career and spend time with family felt tough at times. Cam listened, truly listened, and told me he and his team could definitely make a difference. And quickly. I met Craig and with his expertise in nutrition, his planning of a bespoke gym programme and his genuine support, I haven’t looked back. 10 days in to a 6 week rapid result programme and I’m sleeping better, gym workouts are delivering real strength benefits, pain is easing, eating better and in a week I’ve lost 9lbs. My life is still busy but I now feel happier, more confident in my post op progress and healthier. I cannot wait to see what the next few weeks bring, and then beyond. It’s the best investment I’ve made in me in a long time. And I’m so pleased I’ve done it with Truth Fitness. No more excuses. Just doing it."
  },
  {
    "id": 6,
    "name": "David Wheldon OBE",
    "title": "ex CMO RBS",
    "date": "May 21, 2022",
    "image": "/headshots/David Wheldon OBE.jpeg",
    "testimonial": "When I first met Cam in January 2019 I was 98 kg, not sleeping well and stressed but after a health MOT, Cam and his team got me fighting fit , sleeping well and to 88kg , his very aptly named company Truth is full of talented folk who get you to achieve your goals, always tell it like it is and help you when it gets tough. Cam leads his team with quiet confidence , resilience, compassion, deep expertise and always with a smile, thank you Cam and looking forward to staying fit, leaner and stress free for a very very long time!"
  },
  {
    "id": 7,
    "name": "Eileen Taylor",
    "title": "Non Executive Director Healthcare and Financial Services",
    "date": "April 21, 2022",
    "image": "/headshots/Eileen Taylor.jpeg",
    "testimonial": "Cam and the team at Truth are brilliant to work with. They address the whole person. They are well informed, fun and genuinely nice people who motivate me to get results. They are flexible around work and accommodate me in different time zones. The organisation is professionally run and I would highly recommend them."
  },
  {
    "id": 8,
    "name": "Mark Balaam",
    "title": "Chief Executive Officer at imabi and Sarax Limited",
    "date": "April 19, 2022",
    "image": "/headshots/Mark Balaam.jpeg",
    "testimonial": "As a Founder and CEO of 2 companies, when I first reached out to Cameron and his team at TRUTH, I was dubious about how I would fit the Rapid Result System into my very busy daily schedule. I'm pleased to be able to say that my concerns were totally unfounded. The team was excellent, really flexible and the coaching worked around my diary. As a result, I feel much healthier and fitter than I have been in the past 25yrs, so big thank you to the TRUTH team and long may it continue."
  },
  {
    "id": 9,
    "name": "Dr. Corrie Jonn Block, PhD, DBA",
    "title": "UAE's Top Business Coach",
    "date": "August 24, 2021",
    "image": "/headshots/Dr. Corrie Jonn Block, PhD, DBA.jpeg",
    "testimonial": "You'd be crazy not to call these guys! Ignore their advice at your own peril. As a high performing executive, I've always struggled with my weight and fitness goals. It seems like the only thing in my life I can't absolutely crush on my own. Partnering with Cameron and Tony has been really impactful for me, and I'm happy to be able to recommend my executive coaching clients to them for activating their fitness and nutrition goals."
  },
  {
    "id": 10,
    "name": "Martin Devenish MBE",
    "title": "Board Director S-RM",
    "date": "July 27, 2021",
    "image": "/headshots/Martin Devenish MBE.jpeg",
    "testimonial": "I have been training with the guys at Truth for a couple of years now. What first impressed me was they took time to understand what I was looking to achieve, a bit different from when I first used personal trainers now that I am mid ‘50’s, and built a program focused on being structurally strong alongside nutrition advice. They have adapted well to a virtual offering since early 2020, providing flexibility and a range of coaches, to fit in with a busy work life. I can definitely say I feel healthier today than I would do without their support."
  },
  {
    "id": 11,
    "name": "Angus Kennedy",
    "title": "Chief Technology Officer at Tysers",
    "date": "May 18, 2021",
    "image": "/headshots/Angus Kennedy.jpeg",
    "testimonial": "I believe in TRUTH and the results speak for themselves."
  }
]
